astb_relise/src/DataProcessors/РабочийСтолВнешнегоПользователя/РабочийСтолВнешнегоПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочийСтолВнешнегоПользователя</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйТест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыДляТестов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>CatalogRef.Ответы</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеТесты</name>
    <attributes>
      <name>Тест</name>
      <type>
        <types>CatalogRef.Тесты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВопросыВыбранногоТеста</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыДляТестов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/Enums/СтатусыОбращенийНаСклад/СтатусыОбращенийНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбращенийНаСклад</name>
  <enumValues>
    <name>Открыто</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ОбращениеНаСклад/ОбращениеНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеНаСклад</name>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОбращения</name>
    <type>
      <types>CatalogRef.КатегорииОбращенияНаСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбращения</name>
    <type>
      <types>EnumRef.СтатусыОбращенийНаСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПолучения</name>
    <type>
      <types>CatalogRef.МестаПолучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныНевыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Catalogs/КатегорииОбращенияНаСклад/КатегорииОбращенияНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииОбращенияНаСклад</name>
  <predefined>
    <items>
      <name>ВыдачаДежурныхСредствЗащиты</name>
      <description>Выдача дежурных средств защиты</description>
    </items>
    <items>
      <name>ЗаявкаНаПолучение</name>
      <description>Заявка на получение</description>
    </items>
    <items>
      <name>ИзменениеАнтропометрии</name>
      <description>Изменение антропометрии</description>
    </items>
    <items>
      <name>ИзменениеКадровыхДанных</name>
      <description>Изменение кадровых данных</description>
    </items>
    <items>
      <name>ИзменениеКонтактнойИнформации</name>
      <description>Изменение контактной информации</description>
    </items>
    <items>
      <name>КоллективнаяВыдача</name>
      <description>Коллективная выдача</description>
    </items>
    <items>
      <name>ОбращениеПоОбслуживанию</name>
      <description>Обращение по обслуживанию</description>
    </items>
    <items>
      <name>ОповещениеПоЭлектроннойПочте</name>
      <description>Оповещение по e-mail</description>
    </items>
    <items>
      <name>ОповещениеПоСМС</name>
      <description>Оповещение по SMS</description>
    </items>
    <items>
      <name>ПерсональнаяВыдача</name>
      <description>Персональная выдача</description>
    </items>
    <items>
      <name>ПроизвольнаяВыдача</name>
      <description>Произвольная выдача</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>СписаниеСредствЗащиты</name>
      <description>Списание средств защиты</description>
    </items>
    <items>
      <name>УпрощеннаяВыдача</name>
      <description>Упрощенная выдача</description>
    </items>
  </predefined>
</mdclass:Catalog>

astb_relise/src/DataProcessors/РабочийСтолВнешнегоПользователя/Forms/ФормаВводаЗаявки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЖелаемаяДатаПолучения = ТекущаяДата();
	
	ИзСписка = Истина;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.МестоПолучения.Видимость 				= НЕ ИзСписка;
	Элементы.МестоПолученияИзСправочника.Видимость 	= ИзСписка;
	
КонецПроцедуры	

&НаСервере
Процедура ОтправитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);	
	
	ВнешнийПользователь = ВнешниеПользователи.ТекущийВнешнийПользователь();
	ЗагрузитьЗаявкуНаПолучение(ВнешнийПользователь.ОбъектАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗаявкуНаПолучение(ФизическоеЛицо)
	
	Сотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ФизическоеЛицо",ФизическоеЛицо);
	
	Если ИзСписка Тогда
		ВыбранноеМестоПолучения = ?(ЗначениеЗаполнено(МестоПолученияИзСправочника),МестоПолученияИзСправочника.Наименование, "не определено");
	Иначе
		ВыбранноеМестоПолучения = ?(ЗначениеЗаполнено(МестоПолучения),МестоПолучения, "не определено");
	КонецЕсли;	
	
	НовыйДокумент = Документы.ОбращениеНаСклад.СоздатьДокумент();
	НовыйДокумент.Дата 					= ТекущаяДата();
	НовыйДокумент.КатегорияОбращения 	= Справочники.КатегорииОбращенияНаСклад.ЗаявкаНаПолучение;
	НовыйДокумент.Организация 			= Сотрудник.Владелец;
	НовыйДокумент.СодержаниеОбращения 	= "Желаемое место получения средств защиты: < " + ВыбранноеМестоПолучения + " >";
	НовыйДокумент.СоздательДокумента 	= ВнешниеПользователи.ТекущийВнешнийПользователь();
	НовыйДокумент.Сотрудник 			= Сотрудник;
	НовыйДокумент.СтатусОбращения 		= Перечисления.СтатусыОбращенийНаСклад.Открыто;
	НовыйДокумент.ДатаПолучения			= ЖелаемаяДатаПолучения;
	НовыйДокумент.МестоПолучения		= ?(ИзСписка,МестоПолученияИзСправочника,Справочники.МестаПолучения.ПустаяСсылка());
	НовыйДокумент.Склад					= ПроцедурыРаботыСНормамиСервер.ПолучитьСкладВыдачи(Справочники.Подразделения.ПустаяСсылка(),Сотрудник,Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача);
	Документы.ОбращениеНаСклад.ЗаполнитьТаблицуДокумента(НовыйДокумент);
	НовыйДокумент.УстановитьНовыйНомер();
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзСпискаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры
